{
    "language" : ["html" , "css"  , "javascript" , "sql" , "python" ,"c"  , "coo" , "R"] ,
    "html" : {
        "name" : "HTML" ,
        "Tutorial" : "HTML stands for Hyper Text Markup Language, which is the most widely used language on Web to develop web pages. HTML was created by Berners-Lee in late 1991 but 'HTML 2.0' was the first standard HTML specification which was published in 1995. HTML 4.01 was a major version of HTML and it was published in late 1999. Though HTML 4.01 version is widely used but currently we are having HTML-5 version which is an extension to HTML 4.01, and this version was published in 2012.",
        "Learn" : "Originally, HTML was developed with the intent of defining the structure of documents like headings, paragraphs, lists, and so forth to facilitate the sharing of scientific information between researchers. Now, HTML is being widely used to format web pages with the help of different tags available in HTML language. HTML is a MUST for students and working professionals to become a great Software Engineer specially when they are working in Web Development Domain. I will list down some of the key advantages of learning HTML.",
        "exemple" : "<!DOCTYPE html> \n <html> \n \t <head> \n \t  \t<title> This is document title  </title> \n \t  </head> \n \t  <body> \n \t \t <h1>This is a heading</h1> \n \t \t <p>Hello World!</p> \n \t  </body> \n  </html>",
        "app" : {
            "app1" : "Web pages development",
            "app2":"Internet Navigation",
            "app3" : "Responsive UI" ,
            "app4" : "Offline support"
        },
        "exercise":{
            "question" : "<p .?.='About W3Schools'>W3Schools is a web developer's site.</p>" ,
            "reponse" : "class" 
        },
        "image" : "Programming.gif"
        

    },
    "css" : {
        "name" : "CSS" ,
        "Tutorial" : "CSS is used to control the style of a web document in a simple and easy way.CSS is the acronym for 'Cascading Style Sheet'. This tutorial covers both the versions CSS1,CSS2 and CSS3, and gives a complete understanding of CSS, starting from its basics to advanced concepts." ,
        "Learn":"Cascading Style Sheets, fondly referred to as CSS, is a simple design language intended to simplify the process of making web pages presentable.CSS is a MUST for students and working professionals to become a great Software Engineer specially when they are working in Web Development Domain. I will list down some of the key advantages of learning CSS.",
        "exemple" : "<!DOCTYPE html> \n <html> \n \t <head> \n \t  \t<title> This is document title  </title> \n \t <style> \n \t \t h1 {  \n \t \t color: #36CFFF;  \n \t \t } \n  \t</style> \n   </head> \n \t  <body> \n \t \t <h1>This is a heading</h1> \n \t \t <p>Hello World!</p> \n \t  </body> \n  </html>",
        "app" : {
            "app1" : "Create Stunning Web site",
            "app2":"Become a web designer",
            "app3" : "Control web" ,
            "app4" : "Learn other languages"
        } ,
        "exercise":{
            "question" : "<style>\n\t.hello\t{\n\t\t\n\t.?.:red;\n\n\t}\n</style>" ,
            "reponse" : "color" 
        },
        "image" : "css.svg"

        

    },
    "javascript" : {
        "name" : "JAVASCRIPT" ,
        "Tutorial" : "JavaScript is a lightweight, interpreted programming language. It is designed for creating network-centric applications. It is complimentary to and integrated with Java. JavaScript is very easy to implement because it is integrated with HTML. It is open and cross-platform." ,
        "Learn":"Javascript is a MUST for students and working professionals to become a great Software Engineer specially when they are working in Web Development Domain. I will list down some of the key advantages of learning Javascript.",
        "exemple" : "<html>\n \t<body>\n \t \t<script language = \"javascript\" type = \"text/javascript\">\n \t \t \t document.write(\"Hello World!\")\n \t \t </script>\n \t</body>\n</html>",
        "app" : {
            "app1" : "Client side validation",
            "app2":"Manipulating HTML Pages",
            "app3" : "Back-end Data Loading" ,
            "app4" : "Server Applications"
        } ,
        "exercise":{
            "question" : "let js = \"I Love Javascript\" \n console.?.(js)" ,
            "reponse" : ".log" 
        },
        "image" : "js.svg"

        

    }
}